# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\aadarshxp\_MastersEmbeddedSystem\Semester-2\SystemLevelHardwareDesign\movement_detection_using_radar\40_Implementation\work\30_SW_improve_autoFreqChange\SDHD_MovementDetection.cydsn\SDHD_MovementDetection.cyprj
# Date: Sun, 12 Jul 2020 12:59:32 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clk_600(routed)} -period 1666.6666666666665 -waveform {0 833.333333333333} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {Clk_500Khz(routed)} -period 2000 -waveform {0 1000} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {Clk_350KHz(routed)} -period 2875 -waveform {0 1437.5} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {Clk_200KHz(routed)} -period 5000 -waveform {0 2500} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {Clk_150KHz(routed)} -period 6666.6666666666661 -waveform {0 3333.33333333333} [list [get_pins {ClockBlock/dclk_5}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_DelSig_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clk_600} -source [get_pins {ClockBlock/clk_sync}] -edges {1 41 81} -nominal_period 1666.6666666666665 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clk_500Khz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 49 97} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clk_350KHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 69 139} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clk_200KHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 121 241} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clk_150KHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 161 321} -nominal_period 6666.6666666666661 [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {ADC_DelSig_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 189 377} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {Debounce_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12001 24001} [list [get_pins {ClockBlock/dclk_glb_7}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\aadarshxp\_MastersEmbeddedSystem\Semester-2\SystemLevelHardwareDesign\movement_detection_using_radar\40_Implementation\work\30_SW_improve_autoFreqChange\SDHD_MovementDetection.cydsn\TopDesign\TopDesign.cysch
# Project: C:\aadarshxp\_MastersEmbeddedSystem\Semester-2\SystemLevelHardwareDesign\movement_detection_using_radar\40_Implementation\work\30_SW_improve_autoFreqChange\SDHD_MovementDetection.cydsn\SDHD_MovementDetection.cyprj
# Date: Sun, 12 Jul 2020 12:59:20 GMT
